  $ ./test_lexer.exe <<- EOF
  > пусть икс = икс в 3 + икс
  [line: 1, char: 0-5] пусть
  [line: 1, char: 6-9] имя (маленькое) икс
  [line: 1, char: 10-11] оператор =
  [line: 1, char: 12-15] имя (маленькое) икс
  [line: 1, char: 16-17] в
  [line: 1, char: 18-19] целое число 3
  [line: 1, char: 20-21] оператор +
  [line: 1, char: 22-25] имя (маленькое) икс


  $ ./test_lexer.exe <<- EOF
  > пусть (>>=) = "привет мир" в а >>= б
  [line: 1, char: 0-5] пусть
  [line: 1, char: 6-7] скобка (
  [line: 1, char: 7-10] оператор >>=
  [line: 1, char: 10-11] скобка )
  [line: 1, char: 12-13] оператор =
  [line: 1, char: 14-26] строчка "привет мир"
  [line: 1, char: 27-28] в
  [line: 1, char: 29-30] имя (маленькое) а
  [line: 1, char: 31-34] оператор >>=
  [line: 1, char: 35-36] имя (маленькое) б

  $ ./test_lexer.exe <<- EOF
  > пусть факториал икс =
  >   если икс < 2 то 1
  >   иначе икс * факториал (икс - 1)
  > EOF
  [line: 1, char: 0-5] пусть
  [line: 1, char: 6-15] имя (маленькое) факториал
  [line: 1, char: 16-19] имя (маленькое) икс
  [line: 1, char: 20-21] оператор =
  [line: 2, char: 2-6] если
  [line: 2, char: 7-10] имя (маленькое) икс
  [line: 2, char: 11-12] оператор <
  [line: 2, char: 13-14] целое число 2
  [line: 2, char: 15-17] то
  [line: 2, char: 18-19] целое число 1
  [line: 3, char: 2-7] иначе
  [line: 3, char: 8-11] имя (маленькое) икс
  [line: 3, char: 12-13] оператор *
  [line: 3, char: 14-23] имя (маленькое) факториал
  [line: 3, char: 24-25] скобка (
  [line: 3, char: 25-28] имя (маленькое) икс
  [line: 3, char: 29-30] оператор -
  [line: 3, char: 31-32] целое число 1
  [line: 3, char: 32-33] скобка )

  $ ./test_lexer.exe <<- EOF
  > модуль Птичка = структура
  >   пусть название = "Скворец"
  > конец
  [line: 1, char: 0-6] модуль
  [line: 1, char: 7-13] имя (большое) Птичка
  [line: 1, char: 14-15] оператор =
  [line: 1, char: 16-25] структура
  [line: 2, char: 2-7] пусть
  [line: 2, char: 8-16] имя (маленькое) название
  [line: 2, char: 17-18] оператор =
  [line: 2, char: 19-28] строчка "Скворец"
  [line: 3, char: 0-5] конец

  $ ./test_lexer.exe <<- EOF
  > открыть Птичка
  > модуль Скибидичка = структура
  >   пусть имя икс = икс + Птичка.название
  >   пусть ________аарч64________ () = () () ()
  > конец
  [line: 1, char: 0-7] открыть
  [line: 1, char: 8-14] имя (большое) Птичка
  [line: 2, char: 0-6] модуль
  [line: 2, char: 7-17] имя (большое) Скибидичка
  [line: 2, char: 18-19] оператор =
  [line: 2, char: 20-29] структура
  [line: 3, char: 2-7] пусть
  [line: 3, char: 8-11] имя (маленькое) имя
  [line: 3, char: 12-15] имя (маленькое) икс
  [line: 3, char: 16-17] оператор =
  [line: 3, char: 18-21] имя (маленькое) икс
  [line: 3, char: 22-23] оператор +
  [line: 3, char: 24-30] имя (большое) Птичка
  [line: 3, char: 30-31] точка
  [line: 3, char: 31-39] имя (маленькое) название
  [line: 4, char: 2-7] пусть
  [line: 4, char: 8-30] имя (маленькое) ________аарч64________
  [line: 4, char: 31-32] скобка (
  [line: 4, char: 32-33] скобка )
  [line: 4, char: 34-35] оператор =
  [line: 4, char: 36-37] скобка (
  [line: 4, char: 37-38] скобка )
  [line: 4, char: 39-40] скобка (
  [line: 4, char: 40-41] скобка )
  [line: 4, char: 42-43] скобка (
  [line: 4, char: 43-44] скобка )
  [line: 5, char: 0-5] конец

  $ ./test_lexer.exe <<- EOF
  > пусть рек факториал икс =
  >  если икс < 2 тогда 1 иначе факториал (икс - 1) * икс
  > 
  > пусть рек фибоначчи икс =
  >   если икс < 3 тогда 1
  >   иначе фибоначчи (икс - 1) + фибоначчи (икс - 2)
  > 
  > пусть рек композиция эф гэ икс =
  >   гэ (эф икс)
  > 
  > пусть () =
  >   пусть () = напечатать "Скибиди" в
  >   пусть () = напечатать @@ строка_из_числа (фибоначчи 9) в
  >   пусть () напечатать @@ строка_из_числа (факториал 10) в
  >   пусть факториал_фибоначчи = композиция факториал фибоначчи в
  >   пусть результат = факториал_фибоначчи 5 в
  >   результат |> строка_из_числа |> напечатать
  > 
  > пусть () =
  >   пусть ризз = 0 в
  >   сопоставить Скибиди ризз с
  >   | Скебоп _ -> напечатай "Окэмл про"
  >   | Скибиди ризз когда ризз > 3 -> напечатай "Мощный ризз"
  >   | Скибиди ризз -> напечатай @@ Формат.строка "Слабая аура %d" ризз
  [line: 1, char: 0-5] пусть
  [line: 1, char: 6-9] рек
  [line: 1, char: 10-19] имя (маленькое) факториал
  [line: 1, char: 20-23] имя (маленькое) икс
  [line: 1, char: 24-25] оператор =
  [line: 2, char: 1-5] если
  [line: 2, char: 6-9] имя (маленькое) икс
  [line: 2, char: 10-11] оператор <
  [line: 2, char: 12-13] целое число 2
  [line: 2, char: 14-19] имя (маленькое) тогда
  [line: 2, char: 20-21] целое число 1
  [line: 2, char: 22-27] иначе
  [line: 2, char: 28-37] имя (маленькое) факториал
  [line: 2, char: 38-39] скобка (
  [line: 2, char: 39-42] имя (маленькое) икс
  [line: 2, char: 43-44] оператор -
  [line: 2, char: 45-46] целое число 1
  [line: 2, char: 46-47] скобка )
  [line: 2, char: 48-49] оператор *
  [line: 2, char: 50-53] имя (маленькое) икс
  [line: 4, char: 0-5] пусть
  [line: 4, char: 6-9] рек
  [line: 4, char: 10-19] имя (маленькое) фибоначчи
  [line: 4, char: 20-23] имя (маленькое) икс
  [line: 4, char: 24-25] оператор =
  [line: 5, char: 2-6] если
  [line: 5, char: 7-10] имя (маленькое) икс
  [line: 5, char: 11-12] оператор <
  [line: 5, char: 13-14] целое число 3
  [line: 5, char: 15-20] имя (маленькое) тогда
  [line: 5, char: 21-22] целое число 1
  [line: 6, char: 2-7] иначе
  [line: 6, char: 8-17] имя (маленькое) фибоначчи
  [line: 6, char: 18-19] скобка (
  [line: 6, char: 19-22] имя (маленькое) икс
  [line: 6, char: 23-24] оператор -
  [line: 6, char: 25-26] целое число 1
  [line: 6, char: 26-27] скобка )
  [line: 6, char: 28-29] оператор +
  [line: 6, char: 30-39] имя (маленькое) фибоначчи
  [line: 6, char: 40-41] скобка (
  [line: 6, char: 41-44] имя (маленькое) икс
  [line: 6, char: 45-46] оператор -
  [line: 6, char: 47-48] целое число 2
  [line: 6, char: 48-49] скобка )
  [line: 8, char: 0-5] пусть
  [line: 8, char: 6-9] рек
  [line: 8, char: 10-20] имя (маленькое) композиция
  [line: 8, char: 21-23] имя (маленькое) эф
  [line: 8, char: 24-26] имя (маленькое) гэ
  [line: 8, char: 27-30] имя (маленькое) икс
  [line: 8, char: 31-32] оператор =
  [line: 9, char: 2-4] имя (маленькое) гэ
  [line: 9, char: 5-6] скобка (
  [line: 9, char: 6-8] имя (маленькое) эф
  [line: 9, char: 9-12] имя (маленькое) икс
  [line: 9, char: 12-13] скобка )
  [line: 11, char: 0-5] пусть
  [line: 11, char: 6-7] скобка (
  [line: 11, char: 7-8] скобка )
  [line: 11, char: 9-10] оператор =
  [line: 12, char: 2-7] пусть
  [line: 12, char: 8-9] скобка (
  [line: 12, char: 9-10] скобка )
  [line: 12, char: 11-12] оператор =
  [line: 12, char: 13-23] имя (маленькое) напечатать
  [line: 12, char: 24-33] строчка "Скибиди"
  [line: 12, char: 34-35] в
  [line: 13, char: 2-7] пусть
  [line: 13, char: 8-9] скобка (
  [line: 13, char: 9-10] скобка )
  [line: 13, char: 11-12] оператор =
  [line: 13, char: 13-23] имя (маленькое) напечатать
  [line: 13, char: 24-26] оператор @@
  [line: 13, char: 27-42] имя (маленькое) строка_из_числа
  [line: 13, char: 43-44] скобка (
  [line: 13, char: 44-53] имя (маленькое) фибоначчи
  [line: 13, char: 54-55] целое число 9
  [line: 13, char: 55-56] скобка )
  [line: 13, char: 57-58] в
  [line: 14, char: 2-7] пусть
  [line: 14, char: 8-9] скобка (
  [line: 14, char: 9-10] скобка )
  [line: 14, char: 11-21] имя (маленькое) напечатать
  [line: 14, char: 22-24] оператор @@
  [line: 14, char: 25-40] имя (маленькое) строка_из_числа
  [line: 14, char: 41-42] скобка (
  [line: 14, char: 42-51] имя (маленькое) факториал
  [line: 14, char: 52-54] целое число 10
  [line: 14, char: 54-55] скобка )
  [line: 14, char: 56-57] в
  [line: 15, char: 2-7] пусть
  [line: 15, char: 8-27] имя (маленькое) факториал_фибоначчи
  [line: 15, char: 28-29] оператор =
  [line: 15, char: 30-40] имя (маленькое) композиция
  [line: 15, char: 41-50] имя (маленькое) факториал
  [line: 15, char: 51-60] имя (маленькое) фибоначчи
  [line: 15, char: 61-62] в
  [line: 16, char: 2-7] пусть
  [line: 16, char: 8-17] имя (маленькое) результат
  [line: 16, char: 18-19] оператор =
  [line: 16, char: 20-39] имя (маленькое) факториал_фибоначчи
  [line: 16, char: 40-41] целое число 5
  [line: 16, char: 42-43] в
  [line: 17, char: 2-11] имя (маленькое) результат
  [line: 17, char: 12-14] оператор |>
  [line: 17, char: 15-30] имя (маленькое) строка_из_числа
  [line: 17, char: 31-33] оператор |>
  [line: 17, char: 34-44] имя (маленькое) напечатать
  [line: 19, char: 0-5] пусть
  [line: 19, char: 6-7] скобка (
  [line: 19, char: 7-8] скобка )
  [line: 19, char: 9-10] оператор =
  [line: 20, char: 2-7] пусть
  [line: 20, char: 8-12] имя (маленькое) ризз
  [line: 20, char: 13-14] оператор =
  [line: 20, char: 15-16] целое число 0
  [line: 20, char: 17-18] в
  [line: 21, char: 2-13] сопоставить
  [line: 21, char: 14-21] имя (большое) Скибиди
  [line: 21, char: 22-26] имя (маленькое) ризз
  [line: 21, char: 27-28] с
  [line: 22, char: 2-3] палочка |
  [line: 22, char: 4-10] имя (большое) Скебоп
  [line: 22, char: 11-12] дикая карта
  [line: 22, char: 13-15] стрелка
  [line: 22, char: 16-25] имя (маленькое) напечатай
  [line: 22, char: 26-37] строчка "Окэмл про"
  [line: 23, char: 2-3] палочка |
  [line: 23, char: 4-11] имя (большое) Скибиди
  [line: 23, char: 12-16] имя (маленькое) ризз
  [line: 23, char: 17-22] когда
  [line: 23, char: 23-27] имя (маленькое) ризз
  [line: 23, char: 28-29] оператор >
  [line: 23, char: 30-31] целое число 3
  [line: 23, char: 32-34] стрелка
  [line: 23, char: 35-44] имя (маленькое) напечатай
  [line: 23, char: 45-58] строчка "Мощный ризз"
  [line: 24, char: 2-3] палочка |
  [line: 24, char: 4-11] имя (большое) Скибиди
  [line: 24, char: 12-16] имя (маленькое) ризз
  [line: 24, char: 17-19] стрелка
  [line: 24, char: 20-29] имя (маленькое) напечатай
  [line: 24, char: 30-32] оператор @@
  [line: 24, char: 33-39] имя (большое) Формат
  [line: 24, char: 39-40] точка
  [line: 24, char: 40-46] имя (маленькое) строка
  [line: 24, char: 47-63] строчка "Слабая аура %d"
  [line: 24, char: 64-68] имя (маленькое) ризз

  $ ./test_lexer.exe <<- EOF
  > { скиб = 3 }
  [line: 1, char: 0-1] скобка {
  [line: 1, char: 2-6] имя (маленькое) скиб
  [line: 1, char: 7-8] оператор =
  [line: 1, char: 9-10] целое число 3
  [line: 1, char: 11-12] скобка }

  $ ./test_lexer.exe <<- EOF
  > а; б
  [line: 1, char: 0-1] имя (маленькое) а
  [line: 1, char: 1-2] точка с запятой
  [line: 1, char: 3-4] имя (маленькое) б
